# Terraform CI/CD

- [x] :paintbrush: Check if all Terraform configuration files are in a canonical format
- [x] :hammer_and_wrench: Validate the configuration files
- [x] :scroll: Generate a speculative execution plan

### Terraform Plan output
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.module.group_bots.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "Organization bots, mainly for automation purpose."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "bots"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing tools & best practices."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "sre-engineers"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_devops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing tools & best practices."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "devops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_ops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing infrastructures."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.group_sreengineers_secops.github_team.team[0] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "People managing security of the infrastructures."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "secops"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.iam.module.user_xnbot.github_membership.current will be created
  + resource "github_membership" "current" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "xnbot"
    }

  # module.iam.module.user_xnbot.github_team_membership.team_memberships["bots"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xnbot"
    }

  # module.iam.module.user_xunleii.github_membership.current will be created
  + resource "github_membership" "current" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "xunleii"
    }

  # module.iam.module.user_xunleii.github_team_membership.team_memberships["sre-engineers"] will be created
  + resource "github_team_membership" "team_memberships" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "xunleii"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.
		
The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on iam/modules/group/version.tf line 15, in terraform:
  15:   experiments      = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

(and 6 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

```

#
> _Report based on commit 0bff62da5fadc26a7780177537f8d701ca1e5589 (authored by **@xunleii**).  See [`actions#1042141477`](https://github.com/xnkube/be.xnku/actions/runs/1042141477) for more details._
<!-- Sticky Pull Request Comment -->